9zigen/STM32F0/STEPPER/stm32f0xx_stepper.c
/**
  ******************************************************************************
  * @file    stm32f0xx_stepper.c
  * @author  Domen Jurkovic
  * @version V1.3
  * @date    5-Jan-2014
  * @brief   This file provides functions to manage the
  *          2 and/or 4 pin stepper motor
  *           
  *  @verbatim
 ===============================================================================
                       ##### How to use this driver #####
 ===============================================================================
    (#) Fill stepper struct: stepper_struct stepper1; 
					Note: for accesibility of variables and other stepper data from all functions and interrupt rutines, 
					it is best to declare this variable as global.
				It is esential to fill at these structure variables: (example)
					motor_pin_1_bank = GPIOA;
					motor_pin_1 = GPIO_Pin_4;
					motor_pin_2_bank = GPIOA;
					motor_pin_2 = GPIO_Pin_5;
					// omit these if 2 pin moto is used.
					motor_pin_3_bank = GPIOA;	
					motor_pin_3 = GPIO_Pin_6;
					motor_pin_4_bank = GPIOA;
					motor_pin_4 = GPIO_Pin_7;
					
					//define number of steps per output shaft revolution(including gear ratio)
					steps_per_revolution = 4067;	
						Note:  4076 is default for 28YBJ-48
					
					// if 4 pin motor is used, you can use half-stepping:
					use_half_step = USE_HALF_STEP;
					
					// define if last motor step state is preserved for one extra step delay time or reseted imediately. 
					maintain_position = DONT_MAINTAIN_POS;	
						Note: useful feature when heavy load(flywheel or some heavy gears) are used.
		
		(#) Init stepper: 
			- stepperInit_2pin(stepper_struct* current_stepper);
			- stepperInit_4pin(stepper_struct* current_stepper);
		
		(#) Set stepper speed: [pulses per second] (up to 1000 for 28YBJ-48)
			- setSpeed(&stepper, 500);	
				
		(#)	If needed set (after init()!): 
			- correction_pulses = ___;
					This is number of steps before output shaft actually moves. The same for any direction.
		
		(#) Move methods: 
			- step(&stepper, 500);	
				Move stepper for 500 steps CW. -500 = CCW; 
			
			- moveToTargetPos(&stepper); 
				Move to target_step_number. target_step_number can be changed in some interrupt routine. 
			
			- moveToTargetPosOptimally(&stepper); 
				Move to target_step_number optimally - by calculating the shortest way to reach target_step_number. 
				target_step_number therefore must be in range from -((steps_per_revolution/2)-1) to +(steps_per_revolution/2);
					Note: use setHomePos() or target_step_number = 0; to avoid out-of-range parameters.
				target_step_number can be changed in some interrupt routine. 
				
				
		(#) Other set&move methods:
			- setHomePos(stepper_struct* current_stepper);			
				Set home position. Current step number is new "home" or zero position. All target step numbers 
				are calculated from that point. 
			
			- moveToHomePos(stepper_struct* current_stepper);		
				Move back to home position. 
					Note: To move back home optimally, set 
						target_step_number = 0;
					and use 
						moveToTargetPosOptimally();
						
			- int32_t angleToPulses(int32_t angle);
				Convert angle to pulses - relative to stepper motor defines.
				
			Note: this driver uses TIM16 for delay generating
			Note: this driver was tested with 28YBJ-48 small stepper motor:
				http://arduino-info.wikispaces.com/SmallSteppers
 
*/

/* Includes ------------------------------------------------------------------*/
#include <stm32f0xx_stepper.h>
#include <stdlib.h>

uint8_t TIM16_update_flag = 0;

void stepperInit_2pin(stepper_struct* current_stepper)
{
  // set default values in current_stepper struct
	current_stepper->step_number = 0;							// which step the motor is on
  current_stepper->direction = DIRECTION_CW;		// motor direction
  current_stepper->use_half_step = 0; 					// 1 when the stepper motor is to be driven with half steps (only 4-wire)	
	setSpeed(current_stepper, DEFAULT_PPS);				// set default pulsesPerSecond
	current_stepper->current_step_number = 0;			// set default current position to home position = 0;
	current_stepper->target_step_number = 0;			// set default target position to be the same as home position = 0;
	current_stepper->correction_pulses = 0;				// number of correction pulses - number of steps before output shaft actually moves
	
	// setup the pins on the microcontroller:
  gpio_pinSetup(current_stepper->motor_pin_1_bank, current_stepper->motor_pin_1, GPIO_Mode_OUT, GPIO_OType_PP, GPIO_PuPd_DOWN, GPIO_Speed_50MHz);
	gpio_pinSetup(current_stepper->motor_pin_2_bank, current_stepper->motor_pin_2, GPIO_Mode_OUT, GPIO_OType_PP, GPIO_PuPd_DOWN, GPIO_Speed_50MHz);
  // set default GPIO values
	GPIO_ResetBits(current_stepper->motor_pin_1_bank, current_stepper->motor_pin_1);
	GPIO_ResetBits(current_stepper->motor_pin_2_bank, current_stepper->motor_pin_2);
	
	// pin_count is used by the stepMotor() method:
  current_stepper->pin_count = 2;
	current_stepper->number_of_steps = 4;
	
	timer16_init();
}

void stepperInit_4pin(stepper_struct* current_stepper)
{
	// set default values in current_stepper struct
	current_stepper->step_number = 0;							// which step the motor is on
  current_stepper->direction = DIRECTION_CW;		// motor direction
	setSpeed(current_stepper, DEFAULT_PPS);				// set default pulsesPerSecond
	current_stepper->current_step_number = 0;			// set default home position to current position = 0;
	current_stepper->target_step_number = 0;			// set default target position to be the same as home position = 0;
	current_stepper->correction_pulses = 0;				// number of correction pulses - number of steps before output shaft actually moves
	
  // setup the pins on the microcontroller:
  gpio_pinSetup(current_stepper->motor_pin_1_bank, current_stepper->motor_pin_1, GPIO_Mode_OUT, GPIO_OType_PP, GPIO_PuPd_DOWN, GPIO_Speed_50MHz);
	gpio_pinSetup(current_stepper->motor_pin_2_bank, current_stepper->motor_pin_2, GPIO_Mode_OUT, GPIO_OType_PP, GPIO_PuPd_DOWN, GPIO_Speed_50MHz);
	gpio_pinSetup(current_stepper->motor_pin_3_bank, current_stepper->motor_pin_3, GPIO_Mode_OUT, GPIO_OType_PP, GPIO_PuPd_DOWN, GPIO_Speed_50MHz);
	gpio_pinSetup(current_stepper->motor_pin_4_bank, current_stepper->motor_pin_4, GPIO_Mode_OUT, GPIO_OType_PP, GPIO_PuPd_DOWN, GPIO_Speed_50MHz);
  // set default GPIO values
	GPIO_ResetBits(current_stepper->motor_pin_1_bank, current_stepper->motor_pin_1);
	GPIO_ResetBits(current_stepper->motor_pin_2_bank, current_stepper->motor_pin_2);
	GPIO_ResetBits(current_stepper->motor_pin_3_bank, current_stepper->motor_pin_3);
	GPIO_ResetBits(current_stepper->motor_pin_4_bank, current_stepper->motor_pin_4);
	
  // pin_count is used by the stepMotor():
  current_stepper->pin_count = 4;
	if(current_stepper->use_half_step == USE_HALF_STEP)
	{
		current_stepper->number_of_steps = 8;
	}
	else{
		current_stepper->number_of_steps = 4;
	}
	timer16_init();
}

void timer16_init()
{
	TIM_TimeBaseInitTypeDef timer16;
	RCC_ClocksTypeDef system_freq;
	NVIC_InitTypeDef timer16_int;
	uint32_t timer_freq;
	uint32_t timer_prescaler;
	uint32_t timer_periode;
	
	RCC_GetClocksFreq(&system_freq);	//get system clocks
	timer_freq = system_freq.HCLK_Frequency;	//TIM16 clock 
	timer_prescaler = TIM16_INCREMENT_RESOLUTION * (timer_freq / 1000000);	
	timer_periode = (1000000 / DEFAULT_PPS) / TIM16_INCREMENT_RESOLUTION;	// default pulses per second
	// 1000000/pulses_per_second
	
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_TIM16, ENABLE);	//check smt32f0xx_rcc.c
	timer16.TIM_Prescaler = timer_prescaler;
	timer16.TIM_CounterMode = TIM_CounterMode_Up;
	timer16.TIM_Period = timer_periode -1;						
	timer16.TIM_ClockDivision = TIM_CKD_DIV1;
	TIM_TimeBaseInit(TIM16, &timer16);
	
