9zigen/STM32F0/STEPPER/stm32f0xx_stepper.c
	timer16_int.NVIC_IRQChannel = TIM16_IRQn;
	timer16_int.NVIC_IRQChannelPriority = 3;	// low priority
	timer16_int.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&timer16_int);

	TIM_ClearITPendingBit(TIM16, TIM_IT_Update);
	TIM_ITConfig(TIM16, TIM_IT_Update, ENABLE);	//check smt32f0xx_tim.c
	TIM_Cmd(TIM16, DISABLE);
	TIM16_update_flag = 0;
}	

void TIM16_IRQHandler()
{
	if (TIM_GetITStatus(TIM16, TIM_IT_Update) != RESET)
  {
		TIM_ClearITPendingBit(TIM16, TIM_IT_Update);
		TIM16_update_flag = 1;
		
	}
}

/*
Sets the speed in pulsesPerSecond: 1<1000
*/
void setSpeed(stepper_struct* current_stepper, uint32_t pulsesPerSecond)
{
  uint32_t period = (1000000 / pulsesPerSecond) / TIM16_INCREMENT_RESOLUTION;
	current_stepper->stepper_speed = period - 1;
	//TIM_SetAutoreload(TIM3, period-1);
}

/*
  * Moves the motor steps_to_move steps.  If the number is negative, the motor moves in the reverse direction.
	* blocking function - doesn't allow target change.
 */
void step(stepper_struct* current_stepper, int steps_to_move)
{  
  int steps_left = abs(steps_to_move);  // how many steps to take
	 
  // determine direction based on whether steps_to_move is + or -:
  if (steps_to_move > 0) {current_stepper->direction = DIRECTION_CW;}
  if (steps_to_move < 0) {current_stepper->direction = DIRECTION_CCW;}

  // decrement the number of steps, moving one step each time:
  while(steps_left > 0) {			

		// increment or decrement the step number, depending on direction:
		if( current_stepper->direction == DIRECTION_CW) {
			current_stepper->current_step_number++;	// increment overall step number - from home position
			current_stepper->step_number++;
			if( (current_stepper->step_number) == current_stepper->number_of_steps) {
				current_stepper->step_number = 0;
			}
		} 
		else { 
			current_stepper->current_step_number--;	// decrement overall step number - from home position
			if (current_stepper->step_number == 0) {
				current_stepper->step_number = current_stepper->number_of_steps;
			}
			current_stepper->step_number--;
		}
		// decrement the steps left:
		steps_left--;
		
		if (current_stepper->use_half_step)
		{
			// we have 8 steps, next step number will be 0, 1, 2, 3, 4, 5, 6 or 7:// JZ 20091104
			stepMotor(current_stepper, current_stepper->step_number % 8);	// JZ 20091104
		} else {
			// step the motor to step number 0, 1, 2, or 3:
			stepMotor(current_stepper, current_stepper->step_number % 4);
		}
		
		// create step delay
		TIM16_update_flag = 0;
		TIM_SetAutoreload(TIM16, current_stepper->stepper_speed);	//set period
		TIM_SetCounter(TIM16, 0);
		TIM_Cmd(TIM16, ENABLE);
		while(TIM16_update_flag != 1);
		TIM_Cmd(TIM16, DISABLE);
	}	
	if (current_stepper->maintain_position == MAINTAIN_POS){	//add aditional step delay, before pins are reseted
		TIM16_update_flag = 0;
		TIM_SetCounter(TIM16, 0);
		TIM_Cmd(TIM16, ENABLE);
		while(TIM16_update_flag != 1);
		TIM_Cmd(TIM16, DISABLE);
	}
	//reset motor pins
	GPIO_ResetBits(current_stepper->motor_pin_1_bank, current_stepper->motor_pin_1);
	GPIO_ResetBits(current_stepper->motor_pin_2_bank, current_stepper->motor_pin_2);
	if(current_stepper->pin_count == 4){
		GPIO_ResetBits(current_stepper->motor_pin_3_bank, current_stepper->motor_pin_3);
		GPIO_ResetBits(current_stepper->motor_pin_4_bank, current_stepper->motor_pin_4);
	}
	
}


/*
  * Moves the motor target position.  If the number is negative, the motor moves in the reverse direction.
	* blocking function - allow target change.
 */
void moveToTargetPos(stepper_struct* current_stepper)
{
	int32_t steps_to_move = current_stepper->target_step_number - current_stepper->current_step_number;
	
	while (steps_to_move != 0){
		if(steps_to_move >= 0){
			steps_to_move += current_stepper->correction_pulses;
		}
		else{
			steps_to_move -= current_stepper->correction_pulses;
		}
		
		if (steps_to_move > 0) // determine direction based on whether steps_to_move is + or -:
		{
			current_stepper->direction = DIRECTION_CW;
			current_stepper->current_step_number++;	// increment overall step number - from home position
			current_stepper->step_number++;					// increment motor current step number (1-number_of_steps)

			if( (current_stepper->step_number) == current_stepper->number_of_steps)	{
				current_stepper->step_number = 0;
			}
			if (current_stepper->use_half_step){			
				stepMotor(current_stepper, current_stepper->step_number % 8);	// step the motor to step number 0, 1, 2, 3, 4, 5, 6 or 7
			} 
			else{
				stepMotor(current_stepper, current_stepper->step_number % 4); // step the motor to step number 0, 1, 2, or 3
			}
		}
		else{	//direction = DIRECTION_CCW			
			current_stepper->direction = DIRECTION_CCW;
			current_stepper->current_step_number--;	// decrement overall step number - from home position
				
			if (current_stepper->step_number == 0) {
				current_stepper->step_number = current_stepper->number_of_steps -1;
			}
			else{
				current_stepper->step_number--;	// decrement motor current step number (1-number_of_steps)
			}
			
			if (current_stepper->use_half_step){
				stepMotor(current_stepper, current_stepper->step_number % 8);	// step the motor to step number 0, 1, 2, 3, 4, 5, 6 or 7
			} 
			else{
				stepMotor(current_stepper, current_stepper->step_number % 4); // step the motor to step number 0, 1, 2, or 3
			}
		}
	
		// create step delay
		TIM16_update_flag = 0;
		TIM_SetAutoreload(TIM16, current_stepper->stepper_speed);	//set period
		TIM_SetCounter(TIM16, 0);
		TIM_Cmd(TIM16, ENABLE);
		while(TIM16_update_flag != 1);
		TIM_Cmd(TIM16, DISABLE);
		
		// update steps to move(in the middle of this function some interrupt my change target position)
		steps_to_move = current_stepper->target_step_number - current_stepper->current_step_number;
	}	// end of while loop - step to target.
	
	if (current_stepper->maintain_position == MAINTAIN_POS){	//add aditional step delay, before pins are reseted
		TIM16_update_flag = 0;
		TIM_SetCounter(TIM16, 0);
		TIM_Cmd(TIM16, ENABLE);
		while(TIM16_update_flag != 1);
		TIM_Cmd(TIM16, DISABLE);
	}
	//reset motor pins
	GPIO_ResetBits(current_stepper->motor_pin_1_bank, current_stepper->motor_pin_1);
	GPIO_ResetBits(current_stepper->motor_pin_2_bank, current_stepper->motor_pin_2);
	if(current_stepper->pin_count == 4){
		GPIO_ResetBits(current_stepper->motor_pin_3_bank, current_stepper->motor_pin_3);
		GPIO_ResetBits(current_stepper->motor_pin_4_bank, current_stepper->motor_pin_4);
	}
}

