9zigen/STM32F0/STEPPER/stm32f0xx_stepper.c
/* 
* Blocking move function. Allow change of target position, move optimally
* range: from -((steps_per_revolution/2)-1) to +(steps_per_revolution/2);
*/
void moveToTargetPosOptimally(stepper_struct* current_stepper)
{
	int32_t steps_to_move = 0;
	int32_t abs_steps_to_move = 0;
	
	while (	current_stepper->target_step_number != current_stepper->current_step_number){
		
		steps_to_move = current_stepper->target_step_number - current_stepper->current_step_number;
		abs_steps_to_move = abs(steps_to_move);
		if (abs_steps_to_move > (current_stepper->steps_per_revolution/2)){
			//steps_to_move = -(STEPS_PER_REVOLUTION - abs_steps_to_move);
			if (steps_to_move >= 0) steps_to_move = -(current_stepper->steps_per_revolution - abs_steps_to_move);
			else steps_to_move = current_stepper->steps_per_revolution - abs_steps_to_move;
		}
		
		if (steps_to_move == 0) break;
				
		if (steps_to_move > 0) // direction = DIRECTION_CW:
		{
			current_stepper->direction = DIRECTION_CW;
			current_stepper->current_step_number++;	// increment overall step number - from home position
			current_stepper->step_number++;					// increment motor current step number (1-number_of_steps)
			
			if( (current_stepper->step_number) == current_stepper->number_of_steps){
				current_stepper->step_number = 0;
			}

			if (current_stepper->use_half_step){
				stepMotor(current_stepper, current_stepper->step_number % 8);	// step the motor to step number 0, 1, 2, 3, 4, 5, 6 or 7
			} 
			else{
				stepMotor(current_stepper, current_stepper->step_number % 4); // step the motor to step number 0, 1, 2, or 3
			}
		}
		else{	//direction = DIRECTION_CCW
			current_stepper->direction = DIRECTION_CCW;
			current_stepper->current_step_number--;	// increment overall step number - from home position
						
			if (current_stepper->step_number == 0){
				current_stepper->step_number = current_stepper->number_of_steps -1;
			}
			else{
				current_stepper->step_number--;	// increment motor current step number (1-number_of_steps)
			}
			
			if (current_stepper->use_half_step){
				stepMotor(current_stepper, current_stepper->step_number % 8);	// step the motor to step number 0, 1, 2, 3, 4, 5, 6 or 7
			} 
			else{
				stepMotor(current_stepper, current_stepper->step_number % 4); // step the motor to step number 0, 1, 2, or 3
			}
		}
	
		// create step delay
		TIM16_update_flag = 0;
		TIM_SetAutoreload(TIM16, current_stepper->stepper_speed);	//set period
		TIM_SetCounter(TIM16, 0);
		TIM_Cmd(TIM16, ENABLE);
		while(TIM16_update_flag != 1);
		TIM_Cmd(TIM16, DISABLE);
		
		if (current_stepper->current_step_number > (current_stepper->steps_per_revolution/2)){
			current_stepper->current_step_number = -((current_stepper->steps_per_revolution/2)-1);
		}
		if (current_stepper->current_step_number < -((current_stepper->steps_per_revolution/2)-1)){
			current_stepper->current_step_number = (current_stepper->steps_per_revolution/2);
		}
		
	}	// end of while loop - step to target.
	
	if (current_stepper->maintain_position == MAINTAIN_POS){	//add aditional step delay, before pins are reseted
		TIM16_update_flag = 0;
		TIM_SetCounter(TIM16, 0);
		TIM_Cmd(TIM16, ENABLE);
		while(TIM16_update_flag != 1);
		TIM_Cmd(TIM16, DISABLE);
	}
	//reset motor pins
	GPIO_ResetBits(current_stepper->motor_pin_1_bank, current_stepper->motor_pin_1);
	GPIO_ResetBits(current_stepper->motor_pin_2_bank, current_stepper->motor_pin_2);
	if(current_stepper->pin_count == 4){
		GPIO_ResetBits(current_stepper->motor_pin_3_bank, current_stepper->motor_pin_3);
		GPIO_ResetBits(current_stepper->motor_pin_4_bank, current_stepper->motor_pin_4);
	}
}

// set home position
void setHomePos(stepper_struct* current_stepper)
{
	current_stepper->current_step_number = 0;
}

// move to home position
void moveToHomePos(stepper_struct* current_stepper)
{
	if (current_stepper->current_step_number > 0){
		step(current_stepper, - current_stepper->current_step_number);
	}
	else{
		step(current_stepper, current_stepper->current_step_number);
	}
}

/* convert angle to pulses - relative to stepper motor defines
 * in: degres; max=429000 (=about 1193 rotations if no external gear is used and motor is: 28YBJ-48)
 * relative to stepper steps_per_revolution. 
*/ 
int32_t angleToPulses(stepper_struct* current_stepper, int32_t angle)
{
	int32_t angle_per_pulse = 360*10000 / current_stepper->steps_per_revolution;	//single pulse is  __ degrees
	int32_t pulses = angle*10000 / angle_per_pulse;		// */ 10000 - to avoid calculating with floats 
	return pulses;
}

/*
 * Moves the motor forward or backwards.
 */
void stepMotor(stepper_struct* current_stepper, int this_step)
{
	if (current_stepper->pin_count == 2) {
    switch (this_step) {
      case 0: /* 01 */
				GPIO_ResetBits(current_stepper->motor_pin_1_bank, current_stepper->motor_pin_1);
				GPIO_SetBits(current_stepper->motor_pin_2_bank, current_stepper->motor_pin_2);
				break;
      case 1: /* 11 */
				GPIO_SetBits(current_stepper->motor_pin_1_bank, current_stepper->motor_pin_1);
				GPIO_SetBits(current_stepper->motor_pin_2_bank, current_stepper->motor_pin_2);
				break;
      case 2: /* 10 */
				GPIO_SetBits(current_stepper->motor_pin_1_bank, current_stepper->motor_pin_1);
				GPIO_ResetBits(current_stepper->motor_pin_2_bank, current_stepper->motor_pin_2);
				break;
      case 3: /* 00 */
				GPIO_ResetBits(current_stepper->motor_pin_1_bank, current_stepper->motor_pin_1);
				GPIO_ResetBits(current_stepper->motor_pin_2_bank, current_stepper->motor_pin_2);
				break;
    } 
  }
  if ((current_stepper->pin_count == 4) && (current_stepper->use_half_step == 0)) {
    switch (this_step) {
      case 0:    // 1100
				GPIO_SetBits(current_stepper->motor_pin_1_bank, current_stepper->motor_pin_1);
				GPIO_SetBits(current_stepper->motor_pin_2_bank, current_stepper->motor_pin_2);
				GPIO_ResetBits(current_stepper->motor_pin_3_bank, current_stepper->motor_pin_3);
				GPIO_ResetBits(current_stepper->motor_pin_4_bank, current_stepper->motor_pin_4);
				break;
      case 1:    // 0110
				GPIO_ResetBits(current_stepper->motor_pin_1_bank, current_stepper->motor_pin_1);
				GPIO_SetBits(current_stepper->motor_pin_2_bank, current_stepper->motor_pin_2);
				GPIO_SetBits(current_stepper->motor_pin_3_bank, current_stepper->motor_pin_3);
				GPIO_ResetBits(current_stepper->motor_pin_4_bank, current_stepper->motor_pin_4);
				break;
			case 2:    //0011
				GPIO_ResetBits(current_stepper->motor_pin_1_bank, current_stepper->motor_pin_1);
				GPIO_ResetBits(current_stepper->motor_pin_2_bank, current_stepper->motor_pin_2);
				GPIO_SetBits(current_stepper->motor_pin_3_bank, current_stepper->motor_pin_3);
				GPIO_SetBits(current_stepper->motor_pin_4_bank, current_stepper->motor_pin_4);
				break;
      case 3:    //1001
      	GPIO_SetBits(current_stepper->motor_pin_1_bank, current_stepper->motor_pin_1);
				GPIO_ResetBits(current_stepper->motor_pin_2_bank, current_stepper->motor_pin_2);
				GPIO_ResetBits(current_stepper->motor_pin_3_bank, current_stepper->motor_pin_3);
				GPIO_SetBits(current_stepper->motor_pin_4_bank, current_stepper->motor_pin_4);
				break;
    } 
  }
  if ((current_stepper->pin_count == 4) && (current_stepper->use_half_step == 1)) {
    switch (this_step) {
      case 0:    // 1000
				GPIO_SetBits(current_stepper->motor_pin_1_bank, current_stepper->motor_pin_1);
				GPIO_ResetBits(current_stepper->motor_pin_2_bank, current_stepper->motor_pin_2);
				GPIO_ResetBits(current_stepper->motor_pin_3_bank, current_stepper->motor_pin_3);
				GPIO_ResetBits(current_stepper->motor_pin_4_bank, current_stepper->motor_pin_4);
				break;
      case 1:    // 1100
				GPIO_SetBits(current_stepper->motor_pin_1_bank, current_stepper->motor_pin_1);
				GPIO_SetBits(current_stepper->motor_pin_2_bank, current_stepper->motor_pin_2);
				GPIO_ResetBits(current_stepper->motor_pin_3_bank, current_stepper->motor_pin_3);
				GPIO_ResetBits(current_stepper->motor_pin_4_bank, current_stepper->motor_pin_4);
				break;
      case 2:    // 0100
				GPIO_ResetBits(current_stepper->motor_pin_1_bank, current_stepper->motor_pin_1);
				GPIO_SetBits(current_stepper->motor_pin_2_bank, current_stepper->motor_pin_2);
				GPIO_ResetBits(current_stepper->motor_pin_3_bank, current_stepper->motor_pin_3);
				GPIO_ResetBits(current_stepper->motor_pin_4_bank, current_stepper->motor_pin_4);
				break;
      case 3:    // 0110
				GPIO_ResetBits(current_stepper->motor_pin_1_bank, current_stepper->motor_pin_1);
				GPIO_SetBits(current_stepper->motor_pin_2_bank, current_stepper->motor_pin_2);
				GPIO_SetBits(current_stepper->motor_pin_3_bank, current_stepper->motor_pin_3);
				GPIO_ResetBits(current_stepper->motor_pin_4_bank, current_stepper->motor_pin_4);
				break;
      case 4:    //0010
				GPIO_ResetBits(current_stepper->motor_pin_1_bank, current_stepper->motor_pin_1);
				GPIO_ResetBits(current_stepper->motor_pin_2_bank, current_stepper->motor_pin_2);
				GPIO_SetBits(current_stepper->motor_pin_3_bank, current_stepper->motor_pin_3);
				GPIO_ResetBits(current_stepper->motor_pin_4_bank, current_stepper->motor_pin_4);
				break;
      case 5:    //0011
				GPIO_ResetBits(current_stepper->motor_pin_1_bank, current_stepper->motor_pin_1);
				GPIO_ResetBits(current_stepper->motor_pin_2_bank, current_stepper->motor_pin_2);
				GPIO_SetBits(current_stepper->motor_pin_3_bank, current_stepper->motor_pin_3);
				GPIO_SetBits(current_stepper->motor_pin_4_bank, current_stepper->motor_pin_4);
				break;
      case 6:    //0001
				GPIO_ResetBits(current_stepper->motor_pin_1_bank, current_stepper->motor_pin_1);
				GPIO_ResetBits(current_stepper->motor_pin_2_bank, current_stepper->motor_pin_2);
				GPIO_ResetBits(current_stepper->motor_pin_3_bank, current_stepper->motor_pin_3);
				GPIO_SetBits(current_stepper->motor_pin_4_bank, current_stepper->motor_pin_4);
				break;
      case 7:    //1001
				GPIO_SetBits(current_stepper->motor_pin_1_bank, current_stepper->motor_pin_1);
				GPIO_ResetBits(current_stepper->motor_pin_2_bank, current_stepper->motor_pin_2);
				GPIO_ResetBits(current_stepper->motor_pin_3_bank, current_stepper->motor_pin_3);
				GPIO_SetBits(current_stepper->motor_pin_4_bank, current_stepper->motor_pin_4);
				break;
    } 
  }
}

